Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: By default, Quarkus only supports <<use-annotations-for-path-based-auth,path-based authentication>> for one authentication mechanism selected with annotation per REST endpoint. If more than one authentication mechanism must be used for the <<path-based-authentication>>, you can write a custom `HttpAuthenticationMechanism` as documented in the xref:security-customization.adoc#dealing-with-more-than-one-http-auth-mechanisms[Dealing with more than one HttpAuthenticationMechanism] section of the Security Tips and Tricks guide. Another option is to enable <<inclusive-authentication>> in the lax mode and write a custom `HttpSecurityPolicy` or `PermissionChecker` that verifies that all registered HTTP authentication mechanisms created their mechanism-specific `SecurityIdentity`.
ja_jp: デフォルトでは、Quarkus は REST エンドポイントごとにアノテーションで選択された 1 つの認証メカニズムに対してのみ <<use-annotations-for-path-based-auth,パスベース認証>> をサポートします。<<path-based-authentication>> に複数の認証メカニズムを使用する必要がある場合は、「セキュリティに関するヒントとコツ」ガイドの xref:security-customization.adoc#dealing-with-more-than-one-http-auth-mechanisms[複数の HttpAuthenticationMechanism の処理] セクションに記載されているように、カスタムの `HttpAuthenticationMechanism` を記述できます。もう 1 つの方法は、lax モードで <<inclusive-authentication>> を有効にし、登録されているすべての HTTP 認証メカニズムがメカニズム固有の `SecurityIdentity` を作成したことを確認するカスタムの `HttpSecurityPolicy` または `PermissionChecker` を記述することです。

source: By default, Quarkus provides a built-in `ExceptionMapper` for `MismatchedInputException` which returns an HTTP 400 status code along with a good error message in Dev and Test modes, about what went wrong during serialization of an entity.
ja_jp: デフォルトでは、Quarkus は `MismatchedInputException` には、組み込みの `ExceptionMapper` を提供し、HTTP 400 ステータスコードを返します。 エンティティーのシリアル化中の問題について、開発モードとテストモードで適切なエラーメッセージが表示されます。

source: By default, Quarkus provides three profiles, that activate automatically in certain conditions:
ja_jp: デフォルトでは、Quarkus は 3 つのプロファイルを提供し、特定の条件で自動的にアクティブになります。

source: By default, Quarkus reads configuration properties from <<config-reference.adoc#configuration-sources,several sources>>. For the purpose of this guide, we will use an application configuration file located in `src/main/resources/application.properties`.
ja_jp: デフォルトでは、Quarkusは xref:config-reference.adoc#configuration-sources[複数のソース] から設定プロパティを読み込みます。 このガイドでは、 `src/main/resources/application.properties` にあるアプリケーション設定ファイルを使用します。

source: By default, Quarkus reads configuration properties from <<config-reference.adoc#configuration-sources,several sources>>. For the purpose of this guide, we will use an application configuration file located in `src/main/resources/application.properties`. Edit the file with the following content:
ja_jp: デフォルトでは、Quarkus は <<config-reference.adoc#configuration-sources,複数のソース>> から設定プロパティーを読み取ります。このガイドでは、 `src/main/resources/application.properties` にあるアプリケーション設定ファイルを使用します。以下の内容でファイルを編集します。

source: By default, Quarkus reads configuration properties from multiple sources (by descending ordinal):
ja_jp: デフォルトでは、Quarkus は複数のソースから設定プロパティーを読み取ります (降順)。

source: By default, Quarkus reads configuration properties from xref:config-reference.adoc#configuration-sources[several sources]. For the purpose of this guide, we will use an application configuration file located in `src/main/resources/application.properties`.
ja_jp: デフォルトでは、Quarkusは xref:config-reference.adoc#configuration-sources[複数のソース] から設定プロパティを読み取ります。このガイドの目的から、 `src/main/resources/application.properties` にあるアプリケーション設定ファイルを使用することにします。

source: By default, Quarkus tests in JVM mode are run using the `test` configuration profile. If you are not familiar with Quarkus configuration profiles, everything you need to know is explained in the xref:config-reference.adoc#profiles[Configuration Profiles Documentation].
ja_jp: デフォルトでは、JVMモードのQuarkusテストは、 `test` 設定プロファイルを使用して実行されます。Quarkusの設定プロファイルに慣れていない場合は、 link:config.html#configuration-profiles[設定プロファイル] のドキュメントで必要な情報がすべて説明されていますので、そちらを参照してください。

source: By default, Quarkus tests in JVM mode are run using the `test` configuration profile. If you are not familiar with Quarkus configuration profiles, everything you need to know is explained in the xref:config.adoc#configuration-profiles[Configuration Profiles Documentation].
ja_jp: デフォルトでは、JVM モードでの Quarkus テストは、 `test` 設定プロファイルを使用して実行されます。Quarkus の設定プロファイルについてよく知らない場合は、必要な情報はすべて xref:config.adoc#configuration-profiles[設定プロファイルのドキュメント] で説明されています。

source: By default, Quarkus uses a pattern-based logging formatter that generates human-readable text logs.
ja_jp: デフォルトでは、Quarkusはパターンベースのログフォーマッタを使用して、人間が読めるテキストログを生成します。

source: By default, Quarkus uses available verification keys to verify JWT token signatures with whatever assymetric algorithm is supported by the OIDC provider and the available key set. For example, a token signed with either `RS256` or `PS256` algorithm can be accepted if the JWK set constains a public key that can verify the RSA signature created with either of these two algorithms. However, you may have a policy that requires that only a specific algorithm such as `RS512` must be used - use `quarkus.oidc.token.signature-algorithm=RS512` to enforce it.
ja_jp: デフォルトでは、Quarkus は利用可能な検証キーを使用して、OIDC プロバイダーと利用可能なキーセットによってサポートされている非対称アルゴリズムで JWT トークンの署名を検証します。たとえば、JWK セットに `RS256` または `PS256` アルゴリズムのいずれかで作成された RSA 署名を検証できる公開鍵が含まれている場合、そのアルゴリズムで署名されたトークンを受け入れることができます。ただし、`RS512` などの特定のアルゴリズムのみを使用する必要があるポリシーがある場合は、`quarkus.oidc.token.signature-algorithm=RS512` を使用してこれを強制します。

source: By default, Quarkus waits for 60 seconds for the native image to start before automatically failing the native tests. This duration can be changed using the `quarkus.test.wait-time` system property. For example, to increase the duration to 300 seconds, use: `./mvnw verify -Dnative -Dquarkus.test.wait-time=300`.
ja_jp: Quarkus では、デフォルトでネイティブイメージの起動を 60 秒間待機した後、自動的にネイティブテストが失敗します。 この時間は、 `quarkus.test.wait-time` システムプロパティーを使用して変更できます。 たとえば待機時間を 300 秒に増やす場合、 `./mvnw verify -Dnative -Dquarkus.test.wait-time=300` となります。

source: By default, Quarkus waits for 60 seconds for the native image to start before automatically failing the native tests. This duration can be changed using the `quarkus.test.wait-time` system property. For example, to increase the duration to 300 seconds, use: `./mvnw verify -Pnative -Dquarkus.test.wait-time=300`.
ja_jp: デフォルトでは、Quarkusはネイティブテストを開始し、自動的に失敗するまでに60秒待機します。この時間は、 `quarkus.test.wait-time` システムプロパティーを使用して変更できます。たとえば、待機時間を300秒に増やすには、 `./mvnw verify -Pnative -Dquarkus.test.wait-time=300` となります。

source: By default, Quarkus will automatically generate a main method, that will bootstrap Quarkus and then just wait for shutdown to be initiated. Let's provide our own main method:
ja_jp: デフォルトでは、Quarkusは自動的にメインメソッドを生成し、Quarkusをブートストラップして、シャットダウンが開始されるのを待ちます。独自のメインメソッドを用意しましょう:

source: By default, Quarkus will not discover CDI beans inside another module.
ja_jp: デフォルトでは、Quarkusは別のモジュール内のCDI Bean を検出しません。

source: By default, Quarkus will restrict the use of JNDI within an application, as a precaution to try and mitigate any future vulnerabilities similar to Log4Shell. Because the `mongo+srv` protocol often used to connect to MongoDB requires JNDI, this protection is automatically disabled when using the MongoDB client extension.
ja_jp: デフォルトでは、Quarkusはアプリケーション内でのJNDIの使用を制限します。これは、log4shellのような将来的な脆弱性を軽減するための予防策です。MongoDBへの接続によく使われる `mongo+srv` プロトコルはJNDIを必要とするため、MongoDBクライアントエクステンションを使用すると、この保護機能は自動的に無効になります。

source: By default, Quarkus will restrict the use of JNDI within an application, as a precaution to try and mitigate any future vulnerabilities similar to Log4Shell. Because LDAP based auth requires JNDI this protection will be automatically disabled.
ja_jp: デフォルトでは、Quarkusは、Log4Shellと同様の将来の脆弱性を軽減するための予防措置として、アプリケーション内でのJNDIの使用を制限します。LDAPベースの認証にはJNDIが必要なため、この保護機能は自動的に無効化されます。

source: By default, Quarkus will serve content from under the root context. If you want to change this you can use the `quarkus.http.root-path` config key to set the context path.
ja_jp: デフォルトでは、 Quarkus はルートコンテキストの下からコンテンツを提供します。これを変更したい場合は、 `quarkus.http.root-path` 設定キーを使用してコンテキストパスを設定することができます。

source: By default, Quarkus will try to automatically configure format mappers depending on available extensions. Globally configured `ObjectMapper` (or `Jsonb`) will be used for serialization/deserialization operations when Jackson (or JSON-B) is available. Jackson will take precedence if both Jackson and JSON-B are available at the same time.
ja_jp: デフォルトでは、Quarkus は利用可能なエクステンションに応じてフォーマットマッパーを自動的に設定しようとします。 Jackson (または JSON-B) が利用可能な場合、グローバルに設定された `ObjectMapper` (または `Jsonb`) がシリアル化/デシリアル化操作に使用されます。 Jackson と JSON-B の両方が同時に使用可能な場合は、Jackson が優先されます。

source: By default, RSA `RS256` algorithm is used to sign a JWT authentication token but it can be changed with `quarkus.oidc.credentials.jwt.signature-algorithm`, for example, to Elliptic Curve `ES256`.
ja_jp: デフォルトでは、RSA の `RS256` アルゴリズムが JWT 認証トークンの署名に使用されますが、 `quarkus.oidc.credentials.jwt.signature-algorithm` を使用して、たとえば楕円曲線の `ES256` などに変更できます。

source: By default, Reactive Messaging invokes message processing methods on an event-loop thread. See the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture documentation] for further details on this topic. But, you sometimes need to combine Reactive Messaging with blocking processing such as calling external services or database operations. For this, you can use the link:{rm_blocking_annotation}[@Blocking] annotation indicating that the processing is _blocking_ and should be run on a worker thread. You can read more on the blocking processing in link:{rm_blocking_docs}[SmallRye Reactive Messaging documentation].
ja_jp: デフォルトでは、Reactive Messaging はイベントループスレッドでメッセージ処理メソッドを呼び出します。 このトピックの詳細は、xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture ドキュメント] を参照してください。 ただし、外部サービスの呼び出しやデータベース操作などのブロッキング処理と Reactive Messaging を組み合わせる必要がある場合もあります。 これには、処理が _ブロッキング_ であり、ワーカースレッドで実行する必要があることを示す link:{rm_blocking_annotation}[@Blocking] アノテーションを使用できます。 ブロッキング処理の詳細は、link:{rm_blocking_docs}[SmallRye Reactive Messaging ドキュメント] を参照してください。

source: By default, Swagger UI is accessible at `/q/swagger-ui`.
ja_jp: デフォルトでは、Swagger UIは `/q/swagger-ui` でアクセス可能です。

source: By default, Swagger UI is only available when Quarkus is started in dev or test mode.
ja_jp: デフォルトでは、Swagger UIは、Quarkusを開発モードまたはtestモードで起動したときにのみ使用できます。

source: By default, XA support on datasources is disabled. Therefore, a transaction may include no more than one datasource. Attempting to access multiple non-XA datasources in the same transaction results in an exception similar to the following:
ja_jp: デフォルトでは、データソースでの XA サポートは無効になっています。 したがって、トランザクションには 1 つのデータソースしか含めることができません。 同じトランザクションで複数の非 XA データソースにアクセスしようとすると、次のような例外が発生します。

source: By default, `@UnwrapException` only unwraps exceptions when no exception mapper exists for the wrapper exception or its parent types. You can control the unwrapping behavior using the `strategy` attribute with one of the following values:
ja_jp: デフォルトでは、`@UnwrapException` は、ラッパー例外またはその親タイプに例外マッパーが存在しない場合にのみ例外をアンラップします。`strategy` 属性を以下のいずれかの値で使用して、アンラップ動作を制御できます。

source: By default, `HS256` algorithm requiring a 32 characters long secret is used to sign generated authentication tokens but it can be strengthened with an algorithm such as `HS512` using the `quarkus.oidc.credentials.jwt.signature-algorithm` property.
ja_jp: デフォルトでは、32 文字の長さのシークレットを必要とする `HS256` アルゴリズムが生成された認証トークンの署名に使用されますが、 `quarkus.oidc.credentials.jwt.signature-algorithm` プロパティーを使用して `HS512` などのアルゴリズムで強化することができます。

source: By default, `KeycloakTestResourceLifecycleManager` uses HTTPS to initialize a Keycloak instance that can be disabled by specifying `keycloak.use.https=false`.
ja_jp: デフォルトでは、 `KeycloakTestResourceLifecycleManager` は HTTPS を使用して Keycloak インスタンスを初期化します。これは `keycloak.use.https=false` を指定することで無効にできます。

source: By default, `KeycloakTestResourceLifecycleManager` uses HTTPS to initialize a Keycloak instance that can be disabled by specifying `keycloak.use.https=false`. The default realm name is `quarkus` and client id is `quarkus-web-app` - set `keycloak.realm` and `keycloak.web-app.client` system properties to customize the values if needed.
ja_jp: デフォルトでは、 `KeycloakTestResourceLifecycleManager` がHTTPSを使用してKeycloakインスタンスを初期化します。これは、 `keycloak.use.https=false` を指定することで無効にすることができます。 デフォルトのrealm名は `quarkus` 、クライアントIDは `quarkus-web-app` です。必要に応じて、 `keycloak.realm` 、 `keycloak.web-app.client` システム・プロパティを設定して値をカスタマイズしてください。

source: By default, `KeycloakTestResourceLifecycleManager` uses HTTPS to initialize a Keycloak instance which can be disabled with `keycloak.use.https=false`. Default realm name is `quarkus` and client id - `quarkus-service-app` - set `keycloak.realm` and `keycloak.service.client` system properties to customize the values if needed.
ja_jp: デフォルトでは、 `KeycloakTestResourceLifecycleManager` は HTTPS を使用して Keycloak インスタンスを初期化しますが、 `keycloak.use.https=false` で無効にできます。デフォルトのレルム名は `quarkus` で、クライアント ID `quarkus-service-app` は、必要に応じて値をカスタマイズするために `keycloak.realm` および `keycloak.service.client` システムプロパティーを設定します。

source: By default, `KeycloakTestResourceLifecycleManager` uses HTTPS to initialize a Keycloak instance which can be disabled with `keycloak.use.https=false`. Default realm name is `quarkus` and client id - `quarkus-web-app` - set `keycloak.realm` and `keycloak.web-app.client` system properties to customize the values if needed.
ja_jp: デフォルトでは、 `KeycloakTestResourceLifecycleManager` は HTTPS を使用して Keycloak インスタンスを初期化しますが、 `keycloak.use.https=false` で無効にできます。デフォルトのレルム名は `quarkus` で、クライアント ID `quarkus-web-app` は、必要に応じて値をカスタマイズするために `keycloak.realm` および `keycloak.web-app.client` システムプロパティーを設定します。

source: By default, `KeycloakTestResourceLifecycleManager` uses HTTPS to initialize a Keycloak instance, and this can be disabled by using `keycloak.use.https=false`. The default realm name is `quarkus`, and the client id is `quarkus-service-app`. If you want to customize these values, set the `keycloak.realm` and `keycloak.service.client` system properties.
ja_jp: デフォルトでは、 `KeycloakTestResourceLifecycleManager` は HTTPS を使用して Keycloak インスタンスを初期化します。これは `keycloak.use.https=false` を使用して無効にできます。 デフォルトのレルム名は `quarkus` で、クライアント ID は `quarkus-service-app` です。 これらの値をカスタマイズする場合は、 `keycloak.realm` および `keycloak.service.client` システムプロパティーを設定します。

source: By default, `RestMulti` ensures serial/sequential order of the items/elements produced by the wrapped `Multi` by using a value of 1 for the demand signaled to the publishers. To enable concurrent processing/generation of multiple items, use `withDemand(long demand)`.
ja_jp: デフォルトでは、パブリッシャーに通知される需要に 1 の値を使用して、 `RestMulti`はラップされた `Multi` 要素によって生成されたアイテム/要素のシリアル/連続順序を確保します。 複数のアイテムを同時処理/生成できるようにするには、 `withDemand (long demand)` を使用します。

source: By default, `RestMulti` returns items/elements produced by the wrapped `Multi` as a JSON array, if the media-type is `application/json`. To return separate JSON objects that are not wrapped in a JSON array, use `encodeAsArray(false)` (`encodeAsArray(true)` is the default). Note that streaming multiple objects this way requires a slightly different parsing on the client side, but objects can be parsed and consumed as they appear without having to deserialize a possibly huge result at once.
ja_jp: デフォルトでは、 `RestMulti` は、メディアタイプが `application/json` の場合、ラップされた`Multi` によって生成されたアイテム/要素を JSON 配列として返します。JSON 配列にラップされていない個別の JSON オブジェクトを返すには、 `encodeAsArray(false)` を使用してください（デフォルトは `encodeAsArray(true` です）。この方法で複数のオブジェクトをストリーミングするには、クライアント側で若干異なるパース処理が必要になりますが、オブジェクトは順次パースおよび消費できるため、巨大な結果を一括でデシリアライズする必要はありません。

source: By default, `SecurityIdentity` must be configured with permissions which can be used to check if this identity passes `@PermissionAllowed` authorization restrictions. Alternatively, you can use a `@PermissionChecker` annotation to mark any CDI bean method as a permission checker. The `@PermissionChecker` annotation value should match required permission declared by the `@PermissionsAllowed` annotation value. For example, a permission checker can be created like this:
ja_jp: デフォルトでは、 `Security アイデンティティー` は、この ID が `@PermissionAllowed` 認可制限を通過するかどうかを確認するために使用できる権限で設定されている必要があります。 または、 `@PermissionChecker` アノテーションを使用して、任意の CDI Bean メソッドを権限チェッカーとしてマークすることもできます。 `@PermissionChecker` アノテーション値は、 `@PermissionsAllowed` アノテーション値によって宣言された必要な権限と一致する必要があります。 たとえば、権限チェッカーは次のように作成できます。

source: By default, `\*.proto` files located in the `src/main/proto` directory are compiled into Java sources during the build process.
ja_jp: デフォルトでは、 `src/main/proto` ディレクトリーにある `\*.proto` ファイルは、ビルドプロセス中に Java ソースにコンパイルされます。

source: By default, `include::{includes}/prerequisites.adoc[]` inserts the following asciidoc:
ja_jp: デフォルトでは、 `include::{includes}/prerequisites.adoc[]` は次の asciidoc を挿入します。

source: By default, `pipelining-limit` is set to 256.
ja_jp: デフォルトでは、 `pipelining-limit` は 256 に設定されています。

source: By default, `quarkus.http.root-path` is prepended automatically to configured permission paths then do not use a forward slash, for example:
ja_jp: デフォルトでは、設定された権限のパスの前に自動的に `quarkus.http.root-path` 、フォワードスラッシュを使用しない場合などです。 :

source: By default, `quarkus.oidc.authentication.cookie-path` is set to `/` but you can change this to a more specific path if required, for example, `/web-app`.
ja_jp: デフォルトでは、 `quarkus.oidc.authentication.cookie-path` は `/` に設定されていますが、必要に応じてこれを `/web-app` などのより具体的なパスに変更できます。

source: By default, `quarkus.oidc.authentication.cookie-path` is set to `/`, but you can change this to a more specific path if required, for example, `/web-app`.
ja_jp: デフォルトでは `quarkus.oidc.authentication.cookie-path` は `/` に設定されていますが、必要に応じて `/web-app` などのより具体的なパスに変更できます。

source: By default, `quarkus.oidc.provider=mastodon` sets `quarkus.oidc.auth-server-url` to the `https://mastodon.social` Mastodon server address.
ja_jp: デフォルトでは、 `quarkus.oidc.provider=mastodon` は `quarkus.oidc.auth-server-url` を `https://mastodon.social` に設定されます。

source: By default, `quarkus:dependency-sbom` captures the dependencies of a production build. Quarkus supports three application bootstrap modes: normal (production), test, and dev. In all three modes, an application may have different dependency graphs. The `mode` parameter can be used to indicate which dependency graph should be recorded. If the `mode` is set to `test` or `dev`, the target file name will become `target/<artifactId>-<version>-<mode>-dependency-cyclonedx.json`.
ja_jp: デフォルトでは、 `quarkus:dependency-sbom` はプロダクションビルドの依存関係をキャプチャーします。Quarkus は、normal (プロダクション)、test、dev の 3 つのアプリケーションブートストラップモードをサポートしています。アプリケーションは、モードごとに異なる依存関係グラフを持つことができます。 `mode` パラメーターを使用して、どの依存関係グラフを記録するかを指定できます。 `mode` が `test` または `dev` に設定されている場合、ターゲットファイル名は `target/<artifactId>-<version>-<mode>-dependency-cyclonedx.json` になります。

source: By default, `quarkus:dev` sets the debug host to `localhost` (for security reasons). If you need to change this, for example to enable debugging on all hosts, you can use the `-DdebugHost` option like so:
ja_jp: デフォルトでは、 `quarkus:dev` はデバッグホストを `localhost` に設定します (セキュリティー上の理由から)。これを変更する必要がある場合、例えばすべてのホストでデバッグを有効にしたい場合は、 `-DdebugHost` オプションを次のように使用します。

source: By default, `quarkusDev` sets the debug host to `localhost` (for security reasons). If you need to change this, for example to enable debugging on all hosts, you can use the `-DdebugHost` option like so:
ja_jp: デフォルトでは、 `quarkusDev` はデバッグホストを `localhost` に設定します (セキュリティー上の理由から)。これを変更する必要がある場合、例えばすべてのホストでデバッグを有効にしたい場合は、 `-DdebugHost` オプションを次のように使用します。

source: By default, `track-config-changes` looks for the configuration recorded during previous build and does nothing if it's not found. Enabling `dumpCurrentWhenRecordedUnavailable` parameter will make it dump the current build configuration options taking into account `quarkus.config-tracking.*` configuration.
ja_jp: デフォルトでは、 `track-config-changes` は前回のビルド時に記録された設定を探し、見つからなければ何もしない。 `dumpCurrentWhenRecordedUnavailable` パラメータを有効にすると、 `quarkus.config-tracking.*` の設定を考慮して、現在のビルド設定オプションをダンプします。

source: By default, a channel can be linked to a single consumer, using `@Incoming` method or `@Channel` reactive stream. At application startup, channels are verified to form a chain of consumers and producers with single consumer and producer. You can override this behavior by setting `mp.messaging.$channel.broadcast=true` on a channel.
ja_jp: デフォルトでは、 `@Incoming` メソッドまたは `@Channel` リアクティブストリームを使用して、チャネルを単一のコンシューマーにリンクすることができます。 アプリケーションの起動時に、チャネルが検証され、単一のコンシューマーとプロデューサーを持つコンシューマーとプロデューサーのチェーンが形成されます。 この動作は、チャネルで `mp.messaging.$channel.broadcast=true` を設定することで、オーバーライドできます。

source: By default, a database table used for storing tokens is created for you, however, you can disable this option with the `quarkus.oidc.db-token-state-manager.create-database-table-if-not-exists` configuration property. Should you want the Hibernate ORM extension to create this table instead, you must just include an Entity, such as the following:
ja_jp: デフォルトでは、トークンの保存に使用されるデータベーステーブルが作成されますが、 `quarkus.oidc.db-token-state-manager.create-database-table-if-not-exists` 設定プロパティーを使用して、このオプションを無効にすることができます。 代わりに Hibernate ORM エクステンションでこのテーブルを作成する場合は、次のように Entity を含める必要があります。

source: By default, a database table used for storing tokens is created for you; however, you can disable this option with the `quarkus.oidc.db-token-state-manager.create-database-table-if-not-exists` configuration property. Should you want the Hibernate ORM extension to create this table instead, you must include an Entity, such as the following:
ja_jp: デフォルトでは、トークンの保存に使用されるデータベーステーブルが作成されますが、 `quarkus.oidc.db-token-state-manager.create-database-table-if-not-exists` 設定プロパティーを使用して、このオプションを無効にすることができます。 代わりに Hibernate ORM エクステンションでこのテーブルを作成する場合は、次のように Entity を含める必要があります。

source: By default, a fragment is normally rendered as a part of the original template. However, sometimes it might be useful to mark a fragment as _hidden_ with `rendered=false`. An interesting use case would be a fragment that can be used multiple-times inside the template that defines it.
ja_jp: デフォルトでは、フラグメントは通常、オリジナルテンプレートの一部としてレンダリングされます。しかし、 `rendered=false` を使って、フラグメントを _非表示_ にするのが便利な場合もあります。興味深い使用例として、フラグメントを定義したテンプレートの中で複数回使用できるフラグメントがあります。

source: By default, a fragment is normally rendered as a part of the original template. However, sometimes it might be useful to mark a fragment as _hidden_. The regular fragment section has the `capture` alias that implies a hidden fragment. Alternatively, you can "hide" a fragment either with `rendered=false` or `_hidden` parameters. An interesting use case could be a fragment that can be used multiple-times inside the template that defines it.
ja_jp: デフォルトでは、フラグメントは通常オリジナルテンプレートの一部としてレンダリングされます。 しかし、フラグメントを _非表示_ にすると便利な場合もあります。 通常のフラグメントセクションは、非表示フラグメントを意味する `capture` というエイリアスを持ちます。 また、 `rendered=false` または `_hidden` パラメータを使用して、フラグメントを「非表示」することもできます。興味深い使用例として、フラグメントを定義するテンプレート内で複数回使用できるフラグメントがあります。

source: By default, a request to `/q/openapi` will serve the combined OpenAPI document from the static file and the model generated from application endpoints code. We can however change this to only serve the static OpenAPI document by adding `mp.openapi.scan.disable=true` configuration into `application.properties`.
ja_jp: デフォルトでは、 `/q/openapi` へのリクエストは、静的ファイルとアプリケーション エンドポイント コードから生成されたモデルを組み合わせた OpenAPI ドキュメントを提供します。しかし、 `application.properties` に `mp.openapi.scan.disable=true` 設定を追加することで、静的な OpenAPI ドキュメントのみを提供するように変更することができます。

source: By default, a scheduled method can be executed concurrently. Nevertheless, it is possible to specify the strategy to handle concurrent executions via `@Scheduled#concurrentExecution()`.
ja_jp: デフォルトでは、スケジュールされたメソッドは同時に実行することができます。それにもかかわらず、 `@Scheduled#concurrentExecution()` を通じて同時実行を処理するための戦略を指定することが可能です。
